# -*- coding:utf-8 -*-
# @Author : Emma

# 输出1-10000以内的水仙花数
print("1-10000之间的水仙花数为：")
for a in range(1,10000):                     # 从定义上来说，水仙花数应该是三位数
    if  99< a <1000:
        o = a // 100                         # 取出百位
        p = a % 10                           # 取出各位
        q = int((a - o*100)/10)              # 取出十位
        if o**3 + p**3 + q**3 ==a:
            print(a)
    elif a > 1000:                           # 如果为四位数，则应改为四次方
        i = int(a%10)                        # 取出个位
        j = int(a/1000)                      # 取出千位
        k = int((a - j*1000)/100)            # 取出百位
        l = int(((a - j*1000)- k*100)/10)    # 取出十位
        if i**4 + j**4 +k**4 + l ** 4 == a:
            print(a)

